import math
from typing import List
from collections import deque


class Solution:
    def numBusesToDestination(self, routes: List[List[int]], source: int, target: int) -> int:  # noqa
        if source == target:
            return 0
        N = len(routes)
        edge = [[False] * N for _ in range(N)]
        d = {}
        for i, route in enumerate(routes):
            for site in route:
                lst = d.get(site, [])
                for j in lst:
                    edge[i][j] = True
                    edge[j][i] = True
                lst.append(i)
                d[site] = lst
        dis = [-1 for _ in range(N)]  # 已经到达的车站
        q = deque()
        for bus in d.get(source, []):
            dis[bus] = 1
            q.append(bus)
        while q:
            x = q.popleft()
            for y in range(N):
                if edge[x][y] and dis[y] == -1:
                    dis[y] = dis[x] + 1
                    q.append(y)
        return min(list(dis[x] for x in d.get(target, [])), default=-1)


if __name__ == '__main__':
    s = Solution()

    z = s.numBusesToDestination([[25200, 11857, 28367, 23420, 13979, 9731, 36903, 10068, 47213, 42217, 48926, 48096, 6411, 30173, 31109, 49223, 5768, 15559, 18811, 29014, 13361, 29906, 44542, 22126,
                                  40785, 26527, 30508, 20661, 49600, 29284, 38830, 8045, 28430, 21714, 25392, 33103, 26391, 19478, 40413, 44672, 31236, 43381, 31607, 27904, 31563, 31885, 20877, 45643,
                                  40183, 22443, 37143, 5814, 32492, 22824, 27709, 26991, 31950, 10698, 7931, 19830, 7465, 23751, 21938, 42530, 4166, 17029, 49770, 13365, 36922, 6123, 45387, 40579,
                                  25423, 21164, 24363, 31031, 1278, 25567, 24102, 27407, 36766, 34918, 13669, 36427, 29853, 41076, 3259, 29780, 7812, 21523, 35075, 17621, 47709, 26848, 45564, 33877,
                                  41178, 1408, 16189, 6532, 23851, 24024, 23999, 23787, 37915, 26747, 42949, 23238, 41702, 35901, 39940, 20333, 24470, 8003, 2962, 38051, 16200, 25752, 42506, 44823,
                                  2850, 46584, 47647, 15047, 26188, 40184, 32295, 49828, 31390, 6502, 24775, 43759, 7218, 28956, 40643, 40129, 38867, 30873, 28374, 18152, 48299, 49872, 28436, 23182,
                                  47687, 29438, 37750, 43514, 35682, 35708, 6284, 44307, 44539, 44069, 35409, 28433, 28031, 25516, 24593, 15768, 31511, 16131, 32797, 44739, 36984, 8395, 31988, 26226,
                                  46724, 34667]], source=0, target=100000)
    print(z)
